<!DOCTYPE html PUBLIC "-//W3C//DTD XHTML 1.0 Transitional//EN" "http://www.w3.org/TR/xhtml1/DTD/xhtml1-transitional.dtd">
<html xmlns="http://www.w3.org/1999/xhtml">
<head>
<meta http-equiv="Content-Type" content="text/html; charset=iso-8859-1" />
<title>Documento sin t&iacute;tulo</title>
<style type="text/css">
<!--
.Estilo1 {
	font-size: 60px;
	color: #FFFFFF;
}
body {
	background-color: #3300CC;
}
.Estilo2 {color: #FFFFFF}
-->
</style>
</head>

<body>
<p align="center" class="Estilo1">C++</p>
<p class="Estilo2">C++ es un lenguaje de programaci&oacute;n de prop&oacute;sito general que se deriva del lenguaje de programaci&oacute;n C. Fue creado por Bjarne Stroustrup en la d&eacute;cada de 1980 en los laboratorios Bell para proporcionar caracter&iacute;sticas adicionales a C, como la programaci&oacute;n orientada a objetos (POO) y el soporte para manipulaci&oacute;n de objetos.</p>
<p class="Estilo2">Algunas caracter&iacute;sticas clave de C++ son:</p>
<ol>
  <li class="Estilo2">
    <p><strong>Orientaci&oacute;n a objetos:</strong> C++ es un lenguaje de programaci&oacute;n orientado a objetos, lo que significa que soporta conceptos como clases, objetos, herencia, polimorfismo y encapsulamiento. Estas caracter&iacute;sticas permiten una programaci&oacute;n m&aacute;s modular y organizada.</p>
  </li>
  <li class="Estilo2">
    <p><strong>Compatibilidad con C:</strong> C++ mantiene la compatibilidad con el lenguaje C. Esto significa que el c&oacute;digo C existente puede ser f&aacute;cilmente integrado en programas C++. Adem&aacute;s, muchos de los conceptos y sintaxis de C se aplican directamente en C++.</p>
  </li>
  <li class="Estilo2">
    <p><strong>Rendimiento:</strong> C++ est&aacute; dise&ntilde;ado para ofrecer un rendimiento eficiente y un control directo sobre el hardware. Permite la manipulaci&oacute;n directa de la memoria y ofrece caracter&iacute;sticas como punteros, que brindan a los programadores un mayor control sobre los recursos del sistema.</p>
  </li>
  <li class="Estilo2">
    <p><strong>Plantillas (Templates):</strong> C++ introduce el concepto de plantillas, que permite la programaci&oacute;n gen&eacute;rica. Las plantillas son un mecanismo poderoso que permite escribir c&oacute;digo que funciona con diferentes tipos de datos sin duplicar el c&oacute;digo.</p>
  </li>
  <li class="Estilo2">
    <p><strong>Librer&iacute;as est&aacute;ndar:</strong> C++ incluye una librer&iacute;a est&aacute;ndar (STL) que proporciona una amplia variedad de funcionalidades, como estructuras de datos, algoritmos y funciones matem&aacute;ticas. Esto facilita el desarrollo de aplicaciones sin tener que escribir todo desde cero.</p>
  </li>
  <li class="Estilo2">
    <p><strong>Desarrollo multiplataforma:</strong> C++ es compatible con el desarrollo multiplataforma, lo que significa que el c&oacute;digo escrito en C++ puede compilarse y ejecutarse en diferentes sistemas operativos.</p>
  </li>
  <li>
    <p class="Estilo2"><strong>Ampliamente utilizado en la industria:</strong> C++ es ampliamente utilizado en la industria para el desarrollo de sistemas de software de alto rendimiento, videojuegos, aplicaciones de sistemas embebidos, software de red y m&aacute;s.</p>
  </li>
</ol>
</body>
</html>
