<!DOCTYPE html PUBLIC "-//W3C//DTD XHTML 1.0 Transitional//EN" "http://www.w3.org/TR/xhtml1/DTD/xhtml1-transitional.dtd">
<html xmlns="http://www.w3.org/1999/xhtml">
<head>
<meta http-equiv="Content-Type" content="text/html; charset=iso-8859-1" />
<title>Documento sin t&iacute;tulo</title>
<style type="text/css">
<!--
.Estilo1 {
	font-size: 60px;
	color: #FFFFFF;
}
.Estilo2 {
	font-size: 16px;
	color: #FFFFFF;
}
body {
	background-color: #3300CC;
}
.Estilo3 {color: #FFFFFF}
-->
</style>
</head>

<body>
<p align="center" class="Estilo1">javascript</p>
<p class="Estilo2">JavaScript es un lenguaje de programaci&oacute;n de alto nivel que se utiliza principalmente para agregar interactividad y dinamismo a las p&aacute;ginas web. Es un lenguaje de scripting que se ejecuta en el navegador del usuario, permitiendo la manipulaci&oacute;n del contenido de una p&aacute;gina, la interacci&oacute;n con el usuario y la comunicaci&oacute;n con el servidor.</p>
<p class="Estilo3">Las principales funciones de JavaScript incluyen:</p>
<ol class="Estilo3">
  <li>
    <p><strong>Manipulaci&oacute;n del DOM (Modelo de Objeto del Documento):</strong> JavaScript permite a los desarrolladores acceder, modificar y manipular los elementos HTML y CSS de una p&aacute;gina web. Esto significa que se pueden realizar cambios en tiempo real en la estructura y el estilo de la p&aacute;gina mientras el usuario interact&uacute;a con ella.</p>
  </li>
  <li>
    <p><strong>Manejo de eventos:</strong> JavaScript permite responder a eventos como clics de mouse, pulsaciones de teclas, cambios de estado, etc. Esto posibilita la creaci&oacute;n de p&aacute;ginas web interactivas y din&aacute;micas.</p>
  </li>
  <li>
    <p><strong>Comunicaci&oacute;n asincr&oacute;nica:</strong> JavaScript facilita la comunicaci&oacute;n con el servidor de manera asincr&oacute;nica, lo que significa que puede realizar solicitudes al servidor sin recargar toda la p&aacute;gina. Esto se logra a menudo mediante el uso de tecnolog&iacute;as como XMLHttpRequest o la m&aacute;s moderna Fetch API.</p>
  </li>
  <li>
    <p><strong>Desarrollo de aplicaciones web:</strong> Con el auge de las aplicaciones web, JavaScript se ha convertido en una herramienta esencial para construir aplicaciones complejas que se ejecutan en el navegador del usuario.</p>
  </li>
</ol>
<p class="Estilo2">&nbsp;</p>
</body>
</html>
